# IsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EffectInstance..::..IsValid Method
EffectInstance Class See Also
---
Tests whether the effect instance is valid for rendering.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# ### Return Value
True if the effect instance is valid for rendering, false otherwise.
# Remarks
The effect instances are internally associated with low-level graphics state and may become invalidated when the state changes. Therefore, an application should test each effect instance for validity before using it when submitting geometry. If the effect instance becomes invalid, the application should re-create it.
# See Also
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace